In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import os
import re
import csv

In [7]:
df = pd.read_csv('emprendimientos.csv')
df.head()

,Unnamed: 0,RnD_Expenditure,Admin_Costs,Marketing_Expenditure,Location,Net_Profit,Industry_Sector,Profit,Employee_Count,Investment_Round,Operational_Cost
0,0,165349.20,136897.80,471784.10,New York,192261.83,Energy,227095.722346,289,Series A,608681.90
1,1,162597.70,151377.59,443898.53,California,191792.06,Tech,224711.757208,217,Series B,595276.12
2,2,153441.51,101145.55,407934.54,Florida,191050.39,Finance,222717.429984,407,Series C,509080.09
3,3,144372.41,118671.85,383199.62,New York,182901.99,Finance,214017.365199,383,Series A,501871.47
4,4,142107.34,91391.77,366168.42,Florida,166187.94,Finance,196476.965990,351,Series B,457560.19

In [8]:
df.tail()

,Unnamed: 0,RnD_Expenditure,Admin_Costs,Marketing_Expenditure,Location,Net_Profit,Industry_Sector,Profit,Employee_Count,Investment_Round,Operational_Cost
65,65,134093.502036,47327.344651,26681.272559,California,105423.930052,Tech,120378.804381,335,Seed,74008.617209
66,66,83460.960473,102975.139152,287058.802746,New York,-21313.506762,Healthcare,-14885.847169,430,Seed,390033.941898
67,67,111737.965689,125193.850785,73364.287453,New York,187372.314677,Finance,197551.192890,367,Seed,198558.138238
68,68,28077.387719,2743.241602,294652.768452,New York,62478.033370,Healthcare,64877.719983,258,Seed,297396.010053
69,69,39620.297817,112521.647242,349879.180010,Florida,94597.403597,Healthcare,98661.735576,31,Seed,462400.827252

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70 entries, 0 to 69
Data columns (total 11 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Unnamed: 0             70 non-null     int64
 1   RnD_Expenditure        70 non-null     float64
 2   Admin_Costs            70 non-null     float64
 3   Marketing_Expenditure  70 non-null     float64
 4   Location               70 non-null     object
 5   Net_Profit             70 non-null     float64
 6   Industry_Sector        70 non-null     object
 7   Profit                 70 non-null     float64
 8   Employee_Count         70 non-null     int64
 9   Investment_Round       70 non-null     object
 10  Operational_Cost       70 non-null     float64
dtypes: float64(6), int64(2), object(3)
memory usage: 6.1+ KB

In [10]:
df.describe()

,Unnamed: 0,RnD_Expenditure,Admin_Costs,Marketing_Expenditure,Net_Profit,Profit,Employee_Count,Operational_Cost
count,70.000000,70.000000,70.000000,70.000000,70.000000,70.000000,70.000000,70.000000
mean,34.500000,73645.768116,110300.346605,212932.971333,108074.578648,120746.497961,264.500000,323233.317938
std,20.351085,46643.653676,39611.402919,129284.203274,49144.596277,55478.853960,141.087983,135322.611919
min,0.000000,0.000000,2743.241602,0.000000,-21313.506762,-14885.847169,10.000000,24435.504010
25%,17.250000,37578.659207,96962.557500,120540.355000,78931.372500,83428.580072,144.750000,219525.129324
50%,34.500000,73051.080000,118608.950000,212716.240000,106661.195882,119810.725266,262.000000,322937.665000
75%,51.750000,106300.780101,136547.117500,302423.767500,140623.042127,160098.271102,393.000000,413510.677500
max,69.000000,175623.487278,182645.560000,494430.544453,192261.830000,227095.722346,497.000000,614542.229755

In [11]:
df.isna().sum()

Unnamed: 0               0
RnD_Expenditure          0
Admin_Costs              0
Marketing_Expenditure    0
Location                 0
Net_Profit               0
Industry_Sector          0
Profit                   0
Employee_Count           0
Investment_Round         0
Operational_Cost         0
dtype: int64

In [14]:
df.value_counts('Industry_Sector')

Industry_Sector
Tech          18
Healthcare    17
Finance       13
Energy        11
Retail        11
dtype: int64

In [15]:
df.value_counts('Location')

Location
California    25
New York      25
Florida       20
dtype: int64

In [16]:
df.value_counts('Investment_Round')

Investment_Round
Seed        37
Series C    13
Series B     9
IPO          6
Series A     5
dtype: int64